Revit 2024 API
DefaultDivideSettings.SetSurfaceDistance Method
 Sets the default Divided Surface distance for a fixed, minimum, or maximum distance layout for U or V gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public void SetSurfaceDistance(
	UVGridlineType gridlines,
	double distance
)
Visual Basic
Public Sub SetSurfaceDistance ( _
	gridlines As UVGridlineType, _
	distance As Double _
)
Visual C++
public:
void SetSurfaceDistance(
	UVGridlineType gridlines,
	double distance
)
Parameters
gridlines
Type: Autodesk.Revit.DB.UVGridlineType
 U-gridlines or V-gridlines.
distance
Type: System.Double
 A default distance for a layout.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  The given value for distance must be positive. -or- A value passed for an enumeration argument is not a member of that enumeration
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace